Repository: magi1125/inclusive-design-pattern
Catalog: tm/chapter-14_EN-US_JA.tmx
Source language: en_us
Languages: ja

source: Evaluation By Pattern
ja: パターンごとの評価

source: When I started working on this book, I prepared a rough outline first.
ja: 本書の執筆に着手したとき、私はまずざっくりとした概要を作成しました。

source: This skeleton was organized around theme, or principle.
ja: この概略は、テーマ、または原則を中心に構成しました。

source: That is, I had a chapter stubbed out about keyboard interaction, one about color, another on writing, and so on.
ja: つまり、キーボードインタラクション、色、記述などについて、必要最低限のことのみが書かれた章を用意したのです。

source: It’s good to be prepared, but better to be prepared in the right way.
ja: こうしたものを用意するのは良いことですが、正しい方法で用意するようにしましょう。

source: As I embarked on fleshing out the various chapters, it quickly became apparent that I’d wrong-footed the structure entirely.
ja: 私は、多種多様な章の肉付けに入ってすぐに、完全に構造を誤ったことに気付きました。

source: It just wasn’t compatible with the way I instinctively think and work.
ja: 私の直感的な考え方や作業方法に合っていなかったのです。

source: The trouble was, when I set about describing how to make something keyboard-accessible, I had to bite my tongue not to talk about touch interaction, screen reader compatibility and copywriting as well.
ja: 問題は、何かをキーボードでアクセスできるようにする方法について説明しようと思ったときに、タッチ操作やスクリーンリーダーの互換性、コピーライティングなどについて触れないようにしなくてならなかったことです。

source: It didn’t feel right to expound on making something inclusive in one regard without taking care of all the other problems that might undermine the same example.
ja: 何かをインクルーシブにする方法について、ある1つの点についてのみ詳しく説明し、害になる可能性がある他の問題について何も説明しないのは適切でないと思いました。

source: I’d be leaving the job unfinished.
ja: それでは中途半端になってしまうでしょう。

source: When we design interfaces, we don’t deal in abstract principles, we create working things.
ja: インターフェイスをデザインするとき、私たちは抽象的な原則を扱うのではなく、機能する具体的なものを作ります。

source: Our terminology for these things fluctuates between modules, components, or the looser term patterns, but essentially we mean the parts that contribute to an interface.
ja: それはモジュール、コンポーネント、もっと定義が曖昧な言葉で言えばパターンなど、場合によって変化しますが、基本的にはインターフェイスに寄与する部分を意味します。

source: When creating patterns, we don’t labor according to any one guiding principle; we don’t create keyboard-accessible patterns or internationalized patterns.
ja: パターンを作るとき、何か1つの指針に従うよう努力することはありません。キーボードでアクセスできるパターンや国際化されたパターンを作るのではないのです。

source: We want these patterns to have all the good qualities and, of course, none of the bad ones.
ja: 作りたいのは、すべての優れた質を備え、当然ながら質の悪いところがまったくないパターンです。

source: I ditched the contrived inclusion-by-principle structure early on in favor of talking through discrete patterns — motifs and components you might find in a working website or application.
ja: 私は嘘臭い原則に従ったインクルージョンには早々に見切りをつけ、うまく機能しているWebサイトやアプリケーションに見られるモチーフやコンポーネントといった、個々のパターンについて説明することを選びました。

source: My writing began to flow much more easily because I was essentially documenting my design process: the work of conceiving and realizing inclusive content and functionality.
ja: するとすらすらと筆が進み始めました。基本的に私自身のデザインプロセス（インクルーシブなコンテンツや機能を考え出し、実現するという作業）を文書化していたからです。

source: Since I’m speaking to you as designers, developers and makers yourselves, I figured this would make for clearer and more transferable information for you too.
ja: デザイナー、開発者、作成者の読者を想定した説明なので、この方が皆さんにもより明確で、情報が良く伝わると考えました。

source: The Problem With Evaluating By Principle
ja: 原則ごとに評価する問題点

source: The reason I started out writing by principle is because I often have to wear my accessibility engineer hat and perform accessibility audits.
ja: 最初に原則ごとに書き始めたのは、アクセシビリティエンジニアとしてアクセシビリティ検査を実行することがよくあるからです。

source: I evaluate the accessibility of a website or application, identifying problems and offering guidance for remediation: making things unbroken.
ja: Webサイトやアプリケーションのアクセシビリティを評価し、問題を特定して、「改善」（壊れている箇所の修復）についてアドバイスをするのです。

source: When performing an audit, I defer to WCAG (Web Content Accessibility Guidelines).
ja: 検査を実施する際、私はWCAG（Web Content Accessibility Guidelines）に従います。

source: Though different countries have their own accessibility legislation, WCAG offers the de facto international rule set and is ratified by the W3C standards body.
ja: 国によってアクセシビリティに関する独自の法律がありますが、WCAGは事実上の国際的なルールセットを提供し、標準化団体W3Cによって承認されています。

source: On the whole, it’s better I don’t just tell folks how I think they should have designed their interface!
ja: 概して、検査した対象のインターフェイスをどのようにデザインすべきだったかについて、ただ私がどう考えるかを伝えるよりも良いのです。

source: That WCAG is organized by principle — perceivable, operable, understandable, robust — is to be expected.
ja: WCAGは当然ながら原則（知覚可能、操作可能、理解可能、堅牢）別に整理されています。

source: WCAG doesn’t know in advance precisely which elements, composites and conventions you are going to employ so it has to remain abstract.
ja: WCAGは、皆さんがどの要素、コンポジット、規則を使用するかといった詳細を事前に知らないので、抽象的にならざるを得ないのです。

source: However, this has led manual evaluation experts and automated test tools to report according to principle.
ja: しかしこれが原因で、手動で評価を行うエキスパートや自動化されたテストツールは、原則に照らして結果を報告してきました。

source: We’re fairly wedded to reporting accessibility failures by principle because it’s easier that way to reassure ourselves each and every independent issue has been covered.
ja: 私たちが原則ごとにアクセシビリティの不備を報告するやり方を変えないのは、その方が1つ1つの独立した問題に対応していることを確認しやすいからです。

source: I’m just not convinced development teams find information presented in this way easily actionable.
ja: 開発チームがこの方法で示された情報を簡単に実施できると感じるかどうか、私には確信が持てません。

source: When developer focus moves between integrated components, what good are a hundred disparate and application-wide missing alternative text tickets?
ja: 開発者が統合されたコンポーネント間の動きに注目している場合、それとはまったく関係ないアプリケーション全体にわたる代替テキストの欠落に関する違反報告に、一体何の意味があるというのでしょう。

source: A list of tickets tagged with the bug keyword with titles like ‘Bad alt text on page 76’ and ‘Missing alt text on page 94.’
ja: 問題のある代替テキスト、102ページ［バグ］ 代替テキストの不足、66ページ［バグ］ 不適切な代替テキスト、94ページ［バグ］ 代替テキストの欠如、29ページ［バグ］ 代替テキストの不具合、84ページ［バグ］

source: SIGH!
ja: やれやれ。

source: Time to put the headphones on and fire up some Napalm Death.
ja: ヘッドフォンをつけてナパーム・デスでも聞こうかな。

source: But that’s not all.
ja: それだけではありません。

source: A lot of the time, one issue apparently belonging to one principle or theme is related — either by cause or correlation — to another.
ja: たいていの場合、一見1つの原則またはテーマに属しているように思える問題は、原因または相互関係の点で他の問題とつながっています。

source: Contriving to turn one instance of poor design into two or more reported issues not only complicates the remediation process, but does nothing to educate the developer about how these problems really come about.
ja: 何とか工夫して、1つの質の悪いデザインの事例を2つ以上の問題に分けて報告しても、修正プロセスが複雑になるだけです。また、それらの問題が実際にどのようにして発生したかについて、開発者に教える役にも立ちません。

source: The Button Example (Again)
ja: ボタンの例（再登場）

source: Let’s take another look at the button example from the book’s introduction.
ja: 「はじめに」で紹介したボタンの例をもう一度見てみましょう。

source: Except this time let’s imagine the faux button is for upvoting some content.
ja: ただし今回は、何らかのコンテンツに賛成票を投じるためのボタンという想定です。

source: The button markup looks like this:
ja: ボタンのマークアップは次のようになります。

source: And the button appears like so:
ja: ボタンの見た目はこのようになります。

source: Button shape with a thumbs-up icon to the left and the word ‘upvote’ with an exclamation mark to the right.
ja: 賛成！

source: The separation between style and behavior between the class and data-action attributes is nice and all, but it hardly makes up for the button’s grave shortcomings when it comes to inclusion.
ja: class属性とdata-action属性の間のスタイルと動作の分離については悪くありませんが、インクルーシブという観点ではボタンの重大な欠陥をほとんど補えていません。

source: This time, let’s map those shortcomings to WCAG’s success criteria to establish where there are failings.
ja: 今度は、WCAGの成功基準に照らして、どこに欠陥があるのかはっきりさせましょう。

source: First, under perceivable, the button fails 1.1.1 Non-text Content1 because it has no alternative text to supplement the image of text in the background.
ja: まず、背景のテキスト画像を補完する代替テキストがないので、「知覚可能」の1.1.1「非テキストコンテンツ」（脚注71）を満たしていません。

source: Second, under operable, it fails 2.1.1 Keyboard2 because the button uses an unfocusable <div> element, which — even if you made it to be focusable with tabindex="0" — would still need some JavaScript to trigger click events on pressing the Enter and Space keys.
ja: 次に、フォーカスできない<div>要素を使っているので、「操作可能」の2.1.1「キーボード」（脚注72）を満たしていません。tabindex="0"でフォーカス可能にしたとしても、EnterキーおよびSpaceキーを押してクリックイベントをトリガーするためにはJavaScriptが必要になります。

source: Finally, under robust, the button fails 4.1.2 Name, Role, Value3 because there’s nothing in the markup to communicate in assistive technologies that the button is, indeed, a button.
ja: 最後に、「堅牢性」の4.1.2「名前（name）・役割（role）及び値（value）」（脚注73）を満たしていません。それがボタンであることを支援技術で伝えるものがマークアップ内に何もないからです。

source: Fixing the Button
ja: ボタンの修正

source: Now imagine an accessibility consultant has reported all of these failures in a spreadsheet under columns organized by principle and success criterion.
ja: 次に、アクセシビリティコンサルタントが、これらの欠陥すべてを原則と成功基準別に整理してスプレッドシートにまとめ、報告したとしましょう。

source: This spreadsheet is then handed off to their client’s project manager who sets about writing bug tickets for the developers.
ja: このスプレッドシートはクライアントのプロジェクトマネージャーに渡され、彼は開発者に渡すバグチケットの作成に取りかかります。

source: One developer is randomly assigned a ticket labeled “Upvote Button Missing Label.” They open that ticket and, like any self-respecting developer, endeavor to fix and close it.
ja: 1人の開発者に無作為に割り当てられたのは、「賛成ボタンのラベル欠如」というチケットです。開発者はチケットを開き、誇りある開発者ならだれでもそうするように、修正を行って問題を解決しようと努めます。

source: Not especially familiar with accessible naming techniques, they do a bit of casual research and land on some possible solutions.
ja: アクセシブルな命名テクニックに特に詳しいわけではないその開発者は、ざっと調べて、いくつかの実行可能な解決策に行き着きます。

source: Supplying a text node is out because this would be visible over the top of the background image’s text.
ja: テキストノードを使ったのでは、背景画像のテキストの上に表示されてしまうので問題があります。

source: In the end, they opt for aria-label.
ja: 最終的に、aria-labelを使うことにしました。

source: <div class="upvote" data-action="upvote" aria-label="upvote"></div>
ja: <div class="upvote" data-action="upvote" aria-label="賛成"> </div>

source: Unknown to this developer, another developer is assigned “Upvote Button Not Keyboard-Accessible.” The ticket comes with some guidance from the accessibility consultant about how to make the <div> keyboard-accessible using tabindex and some JavaScript to trigger click events with the keyboard.
ja: この開発者は知りませんが、2人目の開発者には「賛成ボタンがキーボードでアクセスできない」というチケットが割り当てられています。このチケットには、tabindexを使って<div>をキーボードでアクセスできるようにする方法と、キーボードでクリックイベントをトリガーするJavaScriptについて、アクセシビリティコンサルタントからのアドバイスが添えられています。

source: The project’s JavaScript swells slightly and the markup ends up like this:
ja: プロジェクトのJavaScriptがわずかに増え、マークアップは次のようになります。

source: <div class="upvote" data-action="upvote" aria-label="upvote" tabindex="0"></div>
ja: <div class="upvote" data-action="upvote" aria-label="賛成" tabindex="0"></div>

source: Meanwhile, a third developer is dutifully studying “Upvote Button Has Improper Role” and — seeing how much work has gone into this <div> already — tops it off with an explicit ARIA role of "button".
ja: そして、3人目の開発者は「賛成ボタンのロールが不適切」というチケットをしっかりと検討し、すでに<div>に加えられた修正を確認して、“button”という明確なARIAロールを加えて完成させます。

source: <div class="upvote" data-action="upvote" aria-label="upvote" tabindex="0" role="button"></div>
ja: <div class="upvote" data-action="upvote" aria-label="賛成" tabindex="0" role="button"></div>

source: A Better Way
ja: より良い方法

source: The problem with this contrived and fragmented way of evaluating interfaces is that nobody has the chance to point out and avoid what are simply bad ideas, like using a <div> as a button control.
ja: このような不自然で断片化された方法でインターフェイスを評価する問題点は、<div>をボタンコントロールとして使うといった、とてもまずいアイデアを指摘したり避けたりする機会が誰にもないことです。

source: The way failures are reported and developers are tasked means you always end up just patching what’s already there.
ja: このような方法で欠陥を報告し、開発者に作業を割り当てると、どうしてもすでに存在するものにパッチを当てるだけになってしまいます。

source: What you end up with is frequently bloated and less robust.
ja: そしてたいていの場合、肥大化して堅牢性が低い結果になります。

source: In reporting by pattern instead, the consultant has the opportunity to recommend alternative approaches and techniques.
ja: 代わりにパターンで報告すれば、コンサルタントは別のアプローチやテクニックを勧める機会が持てます。

source: In this case, the various failures organized under the upvote button pattern would surely lead them to recommend the use of a standard <button> button element in its place.
ja: このケースでは、賛成ボタンのパターンという項目にまとめられたさまざまな欠陥を見れば、コンサルタントは当然ながら標準の<button>要素を使うよう勧めるはずです。

source: <button data-action="upvote" aria-label="upvote"></button>
ja: <button data-action="upvote" aria-label="賛成"></button>

source: To complete the redesigned pattern they might recommend the use of an SVG to represent the icon.
ja: デザインし直したパターンを完成させるために、コンサルタントはSVGを使ってアイコンを表すことを勧めるかもしれません。

source: As I cover in “A Menu Button,” SVG benefits from being scalable, small in file size and — unlike icon fonts — not breakable by user font preferences.
ja: 「＄＄A Menu Button＄＄」で説明するように、SVGには、拡大縮小が可能でファイルサイズが小さいというメリットがあります。また、アイコンフォントとは異なり、ユーザーのフォント選択によって壊れることもありません。

source: <button data-action="upvote"> <svg aria-label="upvote"> <use xlink:href="#upvote"></use> </svg> </button>
ja: <button data-action="upvote" aria-label="賛成"> <svg> <use xlink:href="#upvote"></use> </svg> </button>

source: To a developer used to working in terms of modules and components, this represents a complete, integrated solution to a problem.
ja: モジュールやコンポーネントという観点での作業に慣れている開発者にとっては、これは問題に対する完全で総合的な解決策となります。

source: The accessibility consultant (reporter) has met them on their home turf and helped them to improve the interface in an apprehensible and tangible way.
ja: アクセシビリティコンサルタント（報告者）は、開発者の得意分野で対応し、理解しやすい具体的な方法でインターフェイスを改善させる手伝いができます。

source: Because the inclusive upvote button replaces the previous implementation one-for-one, the consultant has also helped the organization improve its pattern library.
ja: インクルーシブな賛成ボタンが以前の1対1の実装にとって代わるため、コンサルタントは組織のパターンライブラリを向上させる支援もできます。

source: The next time an upvote button (or similar) is needed, the developer has an exemplar at the ready.
ja: 次に賛成ボタン（または似たようなボタン）が必要になったときは、開発者にはすぐに使える見本があります。

source: This could apply to current or future projects.
ja: これは現在のプロジェクトにも、将来のプロジェクトにも当てはまります。

source: Tickets tagged ‘Enhancement’ and named after patterns, not just problems.
ja: パターン別に整理されたチケットは、パターンライブラリと簡単に調和させることができます。

source: Tickets organized by pattern can be easily reconciled with a pattern library.
ja: 賛成ボタン［エンハンスメント］ ログイン画面［エンハンスメント］ ユーザーアカウントのウィジット［エンハンスメント］ タブのシステム［エンハンスメント］

source: As Joe Dolson writes in “I’m an accessibility consultant.
ja: ジョー・ドルソン（Joe Dolson）が「I’m an accessibility consultant.

source: Stop hiring me4,” remediating broken websites and apps is unpleasant work for both the consultant and the client.
ja: Stop hiring me」（脚注74）で述べているように、壊れたWebサイトやアプリケーションを修正するのは、コンサルタントにとってもクライアントにとっても楽しい作業ではありません。

source: Much more effective and rewarding is training and education in how to design inclusive products from the outset.
ja: 最初からインクルーシブな結果をデザインする方法のトレーニングや教育の方がずっと効果的でやりがいもあります。

source: Remediating by pattern brings design thinking into the remediation process, helping the client to fix their current product while instilling the confidence to make inclusive design decisions in the future.
ja: パターンごとの修正は、修正プロセスにデザイン思考をもたらし、現在の結果を修正するクライアントの助けになると同時に、将来、インクルーシブデザインに関する判断を下す自信を与えます。

source: This is an effective way to make my role as a remediator obsolete and, like Joe, I welcome it.
ja: これは私の修正者としての役割を時代遅れにする効果的な方法です。そしてジョーと同じく、私もそれを歓迎します。

source: Custom Elements And Shadow DOM
ja: Custom ElementsとShadow DOM

source: This is probably as good a place as any to approach the issue of inclusion and web components.
ja: おそらく今がインクルージョンとWeb Componentsの問題に取り組む一番良いタイミングでしょう。

source: Since many organizations are beginning to embrace the web component specifications5 to compose their patterns, we should look at what needs to be done differently or additionally in terms of inclusive design.
ja: 多くの組織がパターンの構成にWeb Components仕様（脚注75）を取り入れ始めているので、インクルーシブデザインの観点で作業にどのような違いがあるか、あるいは追加で何をする必要があるかについて検討すべきです。

source: Of the Shadow DOM, Custom Elements, HTML elements, and HTML templates specifications, only Custom Elements6 and (to a lesser extent) Shadow DOM7 directly pose potential problems.
ja: Shadow DOM、Custom Elements、HTML要素、HTMLテンプレートの中で、直接的に問題を引き起こす可能性があるのはCustom Elements（脚注76）とShadow DOM（脚注77）（Custom Elementsよりは可能性が低い）のみです。

source: Only they affect the behavior of the interface as it is manipulated by the user.
ja: 両者はインターフェイスをユーザーが操作したときに、その動作に影響を与えます。

source: The joy of custom elements is that you can tie custom style and behavior to an element of your own conception.
ja: うれしいことに、Custom Elements（カスタム要素）はカスタムのスタイルや動作を自分が考案した独自の要素に結び付けることができます。

source: You could, for example, write all the code for a toggle button and attach it to a <toggle-button> element: a neat package of functionality with a descriptive name.
ja: たとえば、トグルボタンのコードを一式書いて、それを<toggle-button>要素（分かりやすい名前のすっきりした機能パッケージ）にアタッチできます。

source: // Custom Elements v0 syntax document.registerElement('toggle-button', { prototype: toggleButton }); // Custom Elements v1 syntax customElements.define('toggle-button', toggleButton);
ja: // Custom Elements v0構文 document.registerElement('toggle-button', { prototype: toggleButton }); // Custom Elements v1構文 customElements.define('toggle-button', toggleButton);

source: (Note: For a comparison of Custom Elements versions 0 and 1, see Shawn Allen’s “All about HTML Custom Elements8.”)
ja: （注：Custom Elementsのバージョン0と1の比較は、ショーン・アレン（Shawn Allen）の「All about HTML Custom Elements」（脚注78）を参照してください。）

source: That new element, although accepted as a legitimate element in browsers supporting registerElement or customElements.define, does not have the standard behaviors of a <button> element.
ja: この新しい要素は、registerElementまたはcustomElements.defineをサポートしているブラウザでの適正な要素とされていますが、<button>要素の標準的な動作は備えていません。

source: To put it another way, it is not an instance of the HTMLButtonElement9 prototype.
ja: 言い換えれば、HTMLButtonElement（脚注79）プロトタイプのインスタンスではありません。

source: In fact, it is merely an instance of HTMLElement10, much like a <div>.
ja: 実際のところ、HTMLElement（脚注80）のインスタンスにすぎず、<div>とよく似ています。

source: If you’ve been following along, you’ll know what that means: it’s not focusable or actionable, and doesn’t have the button role that announces it as a button in screen readers — just like the remediated <div> button I was talking about earlier in the chapter.
ja: ここまで読み進めた皆さんには、それが何を意味するかお分かりでしょう。フォーカスができず、実用的でもなく、スクリーンリーダーでボタンであることを知らせるbuttonロールもないボタン、つまり先ほど説明した、修正を加えた<div>ボタンと同じようなものだということです。

source: In the case of our custom element, these features can be added much more neatly and robustly.
ja: ここで例として説明するカスタム要素の場合は、それらの機能をもっとすっきりと確実に追加することができます。

source: Using Custom Elements v0, we add them in the createdCallback lifecycle callback11:
ja: Custom Elements v0を使用して、createdCallbackライフサイクルコールバックに追加するのです。（脚注81）

source: toggleButton.createdCallback = function() { // accept keyboard focus this.setAttribute('tabindex', '0'); // make this element appear as a button in the accessibility tree this.setAttribute('role', 'button'); // start in non pressed state this.addEventListener('keydown', function(event) { if (event.keyCode === 13 || event.keyCode === 32) { var click = new MouseEvent('click', { 'view': this.ownerDocument.defaultView, 'bubbles': true, 'cancelable': true, }); this.dispatchEvent(click); } }); };
ja: toggleButton.createdCallback = function() { // キーボートフォーカスを受け入れる this.setAttribute('tabindex', '0'); // アクセシビリティツリー内でこの要素がボタンとして表示されるようにする this.setAttribute('role', 'button'); // キーボードによるクリックイベントのディスパッチ this.addEventListener('keydown', function(event) { if (event.keyCode === 13 || event.keyCode === 32) { var click = new MouseEvent('click', { 'view': this.ownerDocument.defaultView, 'bubbles': true, 'cancelable': true, }); this.dispatchEvent(click); } }); };

source: Since our toggle button will initialize in the off (unpressed) state, we should also add aria-pressed="false":
ja: このトグルボタンはオフ（押していない）状態で初期化するので、aria-pressed="false"も追加します。

source: The advantage of adding these attributes and behaviors as part of the element’s definition is that the interface remains clean to authors — they only have to instantiate <toggle-button>.
ja: これらの属性や動作を要素の定義の一部として追加するメリットは、<toggle-button>をインスタンス化するだけでいいので、制作者にとってインターフェイスがすっきりと見やすいものになることです。

source: All we need to do now is handle that click event to switch the state.
ja: あとは、clickイベントで状態を切り替えるように対処するだけです。

source: First we add the listener by placing this inside the createdCallback too:
ja: まず、リスナーを追加します。これもcreatedCallback内に配置します。

source: Then we need to create the actual toggle() method.
ja: 次に、実際のtoggle()メソッドを作成する必要があります。

source: With the following in place, the state will change either on click or by scripting toggleInstance.toggle() (where toggleInstance is an instance of <toggle-button>).
ja: 以下を所定の場所に追加すると、clickで、またはtoggleInstance.toggle()をスクリプトすることによって、状態が変化します（toggleInstanceは<toggle-button>のインスタンス）。

source: In terms of semantics and behavior, our <toggle-button> now has all the accessibility provisions of <button>, but also the toggle functionality which makes it deserving of its own element definition.
ja: セマンティクスと動作の観点では、この<toggle-button>は<button>のアクセシビリティ対策をすべて備えているだけでなく、独自の要素定義を必要とするトグル機能も持ちます。

source: In the tradition of <button> we have created an element which has accessibility built in, meaning it can simply be deployed to an interface without having to consider keyboard and screen reader inclusion as separate concerns.
ja: <button>と同様、アクセシビリティが組み込まれた要素を作りました。つまり、キーボードやスクリーンリーダーのインクルージョンを個別の懸案事項として考慮せずに、インターフェイスに配置できるということです。

source: Here’s a demo of this little toggle button implementation, using Custom Elements v012.
ja: このちょっとしたトグルボタンをCustom Elements v0を使用して実装するデモもあります。（脚注82）

source: An easier way to get the basic functionality of a <button> before extending it is to literally extend the HTMLButtonElement prototype.
ja: <button>の基本機能を得てからそれを簡単に拡張するには、文字通りHTMLButtonElementプロトタイプを拡張します。

source: Using Custom Elements v1 with ES2015/ES6 syntax, we can write what follows.
ja: ES2015/ES6構文でCustom Elements v1を使用し、以下を記述できます。

source: Note that in Custom Elements v1, createdCallback is not necessary:
ja: Custom Elements v1ではcreatedCallbackは必要ないことに注意してください。

source: As you can see, now that I’m piggybacking the HTMLButtonElement, I have been able to exclude the tabindex and role attributes, as well as the ugly keydown event dispatching script.
ja: ご覧のとおり、HTMLButtonElementを加えているため、tabindex属性とrole属性だけでなく、keydownイベントをディスパッチする見苦しいスクリプトも除外することができました。

source: We are doing as we set out to do from the very beginning: using what’s already at our disposal.
ja: 最初から目指しているように、すでに自由に使えるものを利用して行っています。

source: It’s more reliable, efficient, and just plain easier.
ja: 信頼性が高く、効率的で、とにかく簡単な方法です。

source: Shadow Boundary Issues
ja: ？？影の境界？？の問題【コメント：定訳が確認できませんでした。複数あります。原文「shadow boundary」】

source: For the most part, creating inclusive web components is just creating accessible, semantic HTML as usual but inside a new API.
ja: ほとんどの場合、インクルーシブなWebコンポーネントの作成は、アクセシブルでセマンティックなHTMLを従来通りに作成しているにすぎませんが、それを新しいAPI内で行います。

source: Two notable differences I’m aware of are the effect the shadow boundary (the boundary between the DOM and Shadow DOM) has on ARIA relationship attributes13, and positive tabindex values.
ja: 私が認識している2つの顕著な違いは、？？影の境界？？（DOMとShadow DOMの間の境界）がARIA関係属性に及ぼす影響（脚注83）と、正のtabindex値です。【コメント：同上】

source: As Steve Faulkner writes in “Some stuff that doesn’t work between the DOM and Shadow DOM14,” the shadow boundary effectively severs relationships built using attributes like aria-labelledby, aria-describedby and aria-controls, where one element in the relationship is the other side of a shadow boundary.
ja: スティーブ・フォルクナーが「Some stuff that doesn’t work between the DOM and Shadow DOM」（脚注84）で書いているように、？？影の境界？？はaria-labelledby、aria-describedby、aria-controlsなどの属性を使って築かれた関係を事実上分断します（関係における一方の要素が、？？影の境界？？の反対側にある場合）。【コメント：同上】

source: There are common misconceptions that all custom elements have shadow DOM included, and that you can only use Shadow DOM with Custom Elements.
ja: よくある誤解は、すべてのCustom ElementsにはShadow DOMが含まれている、そしてShadow DOMはCustom Elementsでのみ使用できる、というものです。

source: No: they’re autonomous technologies.
ja: これは間違いで、両者は独立したテクノロジーです。
